pruebaArtillery2.txt
{
  "aggregate": {
    "counters": {
      "vusers.created_by_name.0": 200,
      "vusers.created": 200,
      "http.requests": 8000,
      "http.codes.200": 8000,
      "http.responses": 8000,
      "vusers.failed": 0,
      "vusers.completed": 200
    },
    "rates": {
      "http.request_rate": 957
    },
    "firstCounterAt": 1670950255455,
    "firstHistogramAt": 1670950255476,
    "lastCounterAt": 1670950263839,
    "lastHistogramAt": 1670950263839,
    "firstMetricAt": 1670950255455,
    "lastMetricAt": 1670950263839,
    "period": 1670950260000,
    "summaries": {
      "http.response_time": {
        "min": 2,
        "max": 316,
        "count": 8000,
        "p50": 202.4,
        "median": 202.4,
        "p75": 206.5,
        "p90": 210.6,
        "p95": 214.9,
        "p99": 219.2,
        "p999": 284.3
      },
      "vusers.session_length": {
        "min": 4865.6,
        "max": 7670.9,
        "count": 200,
        "p50": 7557.1,
        "median": 7557.1,
        "p75": 7557.1,
        "p90": 7709.8,
        "p95": 7709.8,
        "p99": 7709.8,
        "p999": 7709.8
      }
    },
    "histograms": {
      "http.response_time": {
        "min": 2,
        "max": 316,
        "count": 8000,
        "p50": 202.4,
        "median": 202.4,
        "p75": 206.5,
        "p90": 210.6,
        "p95": 214.9,
        "p99": 219.2,
        "p999": 284.3
      },
      "vusers.session_length": {
        "min": 4865.6,
        "max": 7670.9,
        "count": 200,
        "p50": 7557.1,
        "median": 7557.1,
        "p75": 7557.1,
        "p90": 7709.8,
        "p95": 7709.8,
        "p99": 7709.8,
        "p999": 7709.8
      }
    }
  },
  "intermediate": [
    {
      "counters": {
        "vusers.created_by_name.0": 200,
        "vusers.created": 200,
        "http.requests": 4520,
        "http.codes.200": 4321,
        "http.responses": 4321
      },
      "rates": {
        "http.request_rate": 997
      },
      "http.request_rate": null,
      "firstCounterAt": 1670950255455,
      "firstHistogramAt": 1670950255476,
      "lastCounterAt": 1670950259999,
      "lastHistogramAt": 1670950259999,
      "firstMetricAt": 1670950255455,
      "lastMetricAt": 1670950259999,
      "period": "1670950250000",
      "summaries": {
        "http.response_time": {
          "min": 2,
          "max": 316,
          "count": 4321,
          "p50": 206.5,
          "median": 206.5,
          "p75": 206.5,
          "p90": 210.6,
          "p95": 210.6,
          "p99": 223.7,
          "p999": 295.9
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 2,
          "max": 316,
          "count": 4321,
          "p50": 206.5,
          "median": 206.5,
          "p75": 206.5,
          "p90": 210.6,
          "p95": 210.6,
          "p99": 223.7,
          "p999": 295.9
        }
      }
    },
    {
      "counters": {
        "http.requests": 3480,
        "http.codes.200": 3679,
        "http.responses": 3679,
        "vusers.failed": 0,
        "vusers.completed": 200
      },
      "rates": {
        "http.request_rate": 916
      },
      "http.request_rate": null,
      "firstCounterAt": 1670950260000,
      "firstHistogramAt": 1670950260001,
      "lastCounterAt": 1670950263839,
      "lastHistogramAt": 1670950263839,
      "firstMetricAt": 1670950260000,
      "lastMetricAt": 1670950263839,
      "period": "1670950260000",
      "summaries": {
        "http.response_time": {
          "min": 38,
          "max": 232,
          "count": 3679,
          "p50": 194.4,
          "median": 194.4,
          "p75": 206.5,
          "p90": 210.6,
          "p95": 214.9,
          "p99": 214.9,
          "p999": 228.2
        },
        "vusers.session_length": {
          "min": 4865.6,
          "max": 7670.9,
          "count": 200,
          "p50": 7557.1,
          "median": 7557.1,
          "p75": 7557.1,
          "p90": 7709.8,
          "p95": 7709.8,
          "p99": 7709.8,
          "p999": 7709.8
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 38,
          "max": 232,
          "count": 3679,
          "p50": 194.4,
          "median": 194.4,
          "p75": 206.5,
          "p90": 210.6,
          "p95": 214.9,
          "p99": 214.9,
          "p999": 228.2
        },
        "vusers.session_length": {
          "min": 4865.6,
          "max": 7670.9,
          "count": 200,
          "p50": 7557.1,
          "median": 7557.1,
          "p75": 7557.1,
          "p90": 7709.8,
          "p95": 7709.8,
          "p99": 7709.8,
          "p999": 7709.8
        }
      }
    }
  ]
}